<template>
  <div>
    <p>
      この規約（以下「本規約」といいます）は、当社が提供するアプリケーションに関する全てのサービス（以下「本サービス」といいます）の利用に関する条件を、本サービスを利用するお客様（以下「利用者」といいます）と当社との間で定めるものです。
    </p>
    <h2>第1条（規約への同意）</h2>
    <ol>
      <li>本サービスをご利用になる前に、本規約を良くお読みください。</li>
      <li>
        利用者は、本規約の定めに従って本サービスを利用しなければなりません。
      </li>
      <li>
        利用者は会員登録をするにあたり、本規約に同意して頂くことが必要であり、会員登録が完了した時点で、本規約を内容とする本サービス利用契約（以下「本契約」といいます）が当社との間で締結されます。
      </li>
    </ol>
    <br />
    <h2>第2条（規約の適用）</h2>
    <p>
      本規約の規定が利用者との本規約に基づく契約に適用される関連法令に反するとされる場合、当該規定は、その限りにおいて、
      当該利用者との契約には適用されないものとします。但し、この場合でも、本規約の他の規定の効力には影響しないものとします。
    </p>
    <br />
    <h2>第3条（本サービスの提供、無保証、変更および中止）</h2>
    <ol>
      <li>
        当社は、本サービスの提供を受けることができる利用者を、当社が合理的に必要と判断する条件を満たしたお客様に限定することができるものとします。
      </li>
      <li>
        当社は、当社が合理的に必要と判断する場合、
        あらかじめ利用者に通知することなく、いつでも、本サービスの全部または一部の内容を変更し、また、その提供を中止することができるものとします。
        当社は、本規定に基づき当社が行った措置によって利用者に生じた損害について一切の責任を負いません。
      </li>
      <li>
        当社は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、
        正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、
        権利侵害などを含みますが、これらに限りません）がないことを保証しておりません。
      </li>
      <li>
        当社は、本サービスが、全てのパソコン、スマートフォン、タブレット端末等およびOSに対応することを保証しておりません。また、当社は、利用者の環境により本サービスを利用できなかったことに基づき利用者に生じた損害について、一切の責任を負いません。
      </li>
    </ol>
    <br />
    <h2>第4条（利用者の責任および注意義務）</h2>
    <ol>
      <li>
        利用者は、自己の責任に基づき本サービスを利用するものとし、利用者が公開するコンテンツについて、全て自己で責任を負うものとします。
      </li>
      <li>
        利用者は当社に対し、他人の著作物を使用したことなどが原因で紛争、損害賠償の請求などが起こった場合の損害、責任について一切を免責するものとし、自らの責任をもって紛争に対処するものとします。
      </li>
      <li>
        利用者は、本条で定める行為において当社に損害を与えた場合は、当社が当該利用者に対して損害賠償を請求する権利を有することを認めます。
      </li>
      <li>
        当社は、以下のいずれかに該当する場合には、利用者に事前に通知することなく、本サービスの利用の全部又は一部を停止又は中断することができるものとします。
        <ul>
          <li>
            本サービスに係るコンピューター・システムの点検又は保守作業を定期的又は緊急に行う場合
          </li>
          <li>コンピューター、通信回線等が事故により停止した場合</li>
          <li>ログインやサービスの重要な機能に障害が発生した場合</li>
          <li>その他、当社が停止又は中断を必要と判断した場合</li>
        </ul>
      </li>
      <li>
        当社は、本条に基づき当社が行った措置に基づき利用者に生じた損害について一切の責任を負いません。
      </li>
    </ol>
    <br />
    <h2>第5条（禁止事項）</h2>
    <p>
      利用者は、本サービスの利用に際して、以下の行為を行ってはならないものとします。利用者がこれらの禁止行為を行った、又は行うおそれがあると当社が合理的に判断した場合、利用者に通知することなく、当社は該当する内容のデータの削除、当該利用者に対して注意を促す表示を行う、または利用制限もしくは強制退会させることができるものとします。ただし、当社は、当該データ等を掲載停止または削除する義務を負うものではなく、データの削除および利用制限等の処分につきまして当社は説明の義務を負わないものとします。
    </p>
    <p>
      利用者は、これらの禁止行為を行うことにより当社に損害を与えた場合は、当社が当該利用者に対して損害賠償を請求する権利を有することを認めます。
    </p>
    <p>
      なお、当社は、本条に基づき当社が行った措置に基づき利用者に生じた損害について一切の責任を負いません。
    </p>
    <ol>
      <li>
        会員のアイコン画像、本サービス上の画像を当社の承諾なくキャプチャーその他の方法により複製、利用又は公開する行為
      </li>
      <li>本規約に反する行為</li>
      <li>日本国または利用者に適用される国・地域の法令に違反する行為</li>
      <li>
        社会規範・公序良俗に反するものや、他人の権利を侵害し、または他人の迷惑となるようなものを、投稿、掲載、開示、提供または送信（以下これらを総称して「投稿など」といいます）したりする行為
      </li>
      <li>
        本サービスに関連して、反社会的勢力に直接・間接に利益を提供する行為
      </li>
      <li>
        本サービスを、提供の趣旨に照らして本来のサービス提供の目的とは異なる目的で利用する行為
      </li>
      <li>
        他の利用者を含む第三者の個人情報や利用者情報を第三者に開示または漏洩する行為
      </li>
      <li>
        性描写、残酷な表現、犯罪を誘発する表現、差別表現など、公序良俗に反する行為やコンテンツ閲覧者
      </li>
      <li>第三者に成りすます行為</li>
      <li>虚偽の情報をコンテンツに掲載し、コンテンツ閲覧者を欺く行為</li>
      <li>
        第三者の名誉や社会的信用を毀損したり、不快感や精神的な損害を与える行為
      </li>
      <li>
        選挙運動、またはこれらに類似する行為および公職選挙法に抵触する行為
      </li>
      <li>
        当社、他の利用者またはその他の第三者の保有する著作権を含む知的財産権、肖像権その他一切の権利を侵害し、または侵害を誘発する行為
      </li>
      <li>
        当社が許可した場合を除き、会員の情報を無断で使用する行為（モザイク処理をしても、当社が許可をしていない場合は無断使用と見なします）
      </li>
      <li>本サービスの運営を妨げる行為</li>
      <li>
        当社が、本サービスの運営を妨げるおそれがあると判断する量のデータ転送、サーバーに負担をかける行為（不正な連続アクセスなど）
      </li>
      <li>
        有害なコンピュータウィルス、コード、ファイル、プログラム等を開示する行為、もしくは開示されている場所について示唆する行為
      </li>
      <li>
        無限連鎖講およびマルチ商法、またはそれに類するもの、その恐れのあるもの、あるいは当社が無限連鎖講およびマルチ商法、またはそれに類するもの、その恐れのあるものと判断する内容を掲載する行為
      </li>
      <li>
        児童ポルノ、またはそれに類する内容、あるいは当社が児童ポルノに類すると判断する内容を掲載する行為
      </li>
      <li>
        性器露出画像、動画、あるいは性器を描写したデータ等、当社が性器を描写した内容であると判断した内容のサイトへのリンクを掲載する行為
      </li>
      <li>
        次のようなコンテンツを投稿などすること
        <ul>
          <li>許可を得ないで第三者のプロフィールや写真を使用したコンテンツ</li>
          <li>
            集団および個人に対するあらゆる種類の人種差別や偏見、憎悪、身体的危害を助長するコンテンツのような、オンラインコミュニティーに対して明らかに不快だと思われるコンテンツ
          </li>
          <li>
            他人への嫌がらせのコンテンツ、または嫌がらせを支持するコンテンツ
          </li>
          <li>
            嘘であることや誤解を招くということを利用者がわかっている情報を広めるコンテンツや、違法行為を助長するコンテンツ、または罵倒、脅迫、わいせつ、名誉毀損、文書による名誉毀損に当たるような行為を助長するコンテンツ
          </li>
          <li>
            ｢ジャンクメール｣、｢チェーンメール｣、迷惑メール、｢スパム｣などの送信に関連するコンテンツ
          </li>
          <li>
            海賊版コンピュータ･プログラムを提供したり、それにリンクを張ったり、製品に組み込まれたコピー防止機能を回避する情報を提供したり、海賊版音楽を提供したり、海賊版音楽ファイルにリンクを張ったりするなどして、他人の著作権によって保護された作品を違法または不正にコピーすることを助長するコンテンツ
          </li>
          <li>
            性的または暴力的な手法で18歳未満の人を不当に利用するコンテンツ。または、18歳未満の人から個人情報を求める構成要素を提供するコンテンツ
          </li>
          <li>
            営利的または違法な目的のために、他の利用者からパスワードや個人情報を求めるコンテンツ
          </li>
          <li>
            違法な武器の製造、購入や、他人のプライバシーの侵害、コンピュータウィルスの製造など、違法行為に関する説明を提供するコンテンツ
          </li>
        </ul>
      </li>
    </ol>
    <br />
    <h2>第6条（利用者のデータおよびコンテンツの取扱い）</h2>
    <p>
      当社の本サービスの保守や改良などの必要が生じた場合には、当社は利用者が当社の管理するサーバーに保存しているデータを、本サービスの保守や改良などに必要な範囲で複製等することができるものとします。
    </p>
    <p>
      利用者が投稿などをしたコンテンツ（画像データ、テキストを含みますが、これらに限られません。以下「投稿コンテンツ」といいます）については、利用者または当該投稿コンテンツの著作権者に著作権が帰属します。
    </p>
    <p>
      本サービスおよび本サービスに関連する一切の情報についての著作権およびその他知的財産権はすべて当社または当社がその利用を許諾した権利者に帰属し、利用者は無断で複製、譲渡、貸与、翻訳、改変、転載、公衆送信（送信可能化を含みます）、伝送、配布、出版、営業使用等をしてはならないものとします。
    </p>
    <p>
      当社は、他の利用者の投稿コンテンツを利用したことによって利用者に生じた損害について、一切の保証をいたしません。
    </p>
    <br />
    <h2>第7条（会員間の紛争）</h2>
    <p>
      利用者は、自己の責任に基づき本サービスを利用するものとし、本サービスの他の会員との交流に関しては、単独で責任を負うものとします。
    </p>
  </div>
</template>

<script>
export default {
  name: 'SupportTerms',
  auth: false,
  layout: 'support'
}
</script>

<style scoped>
h2 {
  font-size: 1.2em;
  color: black;
  margin-top: 10px;
  margin-bottom: 10px;
}

li {
  color: black;
}

p {
  color: black;
}
</style>
